IDENTIFICATION DIVISION.
PROGRAM-ID. OLDADD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  A         PIC 9(04).
01  B         PIC 9(04).
01  C         PIC 9(04).
PROCEDURE DIVISION.
    ACCEPT A.
    ACCEPT B.
    ADD A TO B GIVING C.
    DISPLAY C.
    STOP RUN.